# Essential Functionality

## Indexing, Selection, Filtering

In [1]:
import pandas as pd
import numpy as np

In [3]:
obj = pd.Series(np.arange(4.),index=['a','b','c','d'])

In [4]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [5]:
# indexing
obj['b']

1.0

In [6]:
obj[1]

1.0

In [7]:
# selecting 
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [8]:
obj[['a','c','d']]

a    0.0
c    2.0
d    3.0
dtype: float64

In [9]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [10]:
obj[-1]

3.0

In [13]:
obj[0]

0.0

In [17]:
# filtring
obj[obj==3]

d    3.0
dtype: float64

In [18]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [19]:
obj['b','c']=5.

In [20]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

##### DATAFRAME

In [21]:
data=pd.DataFrame(np.arange(16).reshape(4,4),
                 index=['one','two','three','four'],
                 columns=['ouarzazate','rabat','casa','agadir'])

In [22]:
data

       ouarzazate  rabat  casa  agadir
one             0      1     2       3
two             4      5     6       7
three           8      9    10      11
four           12     13    14      15

In [23]:
#indexing
data['ouarzazate']

one       0
two       4
three     8
four     12
Name: ouarzazate, dtype: int32

In [25]:
data.ouarzazate

one       0
two       4
three     8
four     12
Name: ouarzazate, dtype: int32

In [29]:
data[['ouarzazate','rabat']]

       ouarzazate  rabat
one             0      1
two             4      5
three           8      9
four           12     13

In [31]:
data[:3]

       ouarzazate  rabat  casa  agadir
one             0      1     2       3
two             4      5     6       7
three           8      9    10      11

In [35]:
#filitring
data[data['rabat']!=5]

       ouarzazate  rabat  casa  agadir
one             0      1     2       3
three           8      9    10      11
four           12     13    14      15

In [36]:
data>5

       ouarzazate  rabat   casa  agadir
one         False  False  False   False
two         False  False   True    True
three        True   True   True    True
four         True   True   True    True

In [41]:
data[data!=4]

       ouarzazate  rabat  casa  agadir
one           0.0      1     2       3
two           NaN      5     6       7
three         8.0      9    10      11
four         12.0     13    14      15